
'''
# 백문의 불여일타
# 한글로 우선 작성하여 로직을 구성할지 먼저 한글로 써본다.
# 관련 문법에 뭐가 있는지 코드를 추가한다.
# ----------------------------------------------------------------------------------------------
# 지창희 팀장님 코멘트

list() 
[] 

sum_list = [] 

for j in range(1,7):                             # 주사위 1번 굴리기                                          
    for k in range(1, 7):   


j + k = > 1, 1/ 
sum = j + k 


# 주사위 1 
for j in range(1,7):                             # 주사위 1번 굴리기                                          
        # 주사위 2 
for k in range(1, 7):                        # 주사위 2번 굴리기
        # 주사위의 합, 주사위의 합의 경우의 수(중복 제거) 
if i == j+k :                            # key값 i 와 주사위 2개의 합계가 같을 때 경우
            values = j,k                         # 주사위 번호를 변수에 저장                              
            values_list.append(values) 

# 주사위 1 : for() 
# 주사위 2: for() 
# sum 별로 경우의 수 나와야함 
#  합계 = 주사위1 + 주사위2  




for i in range(2, 13):  #  key 값 - 주사위 합계 경우의 수 생성
    # value값 - key 값이 증가 할 때 마다 key 값에 들어갈 list 생성
    values_list = []
    for j in range(1, 7):                             # 주사위 1번 굴리기
        for k in range(1, 7):                        # 주사위 2번 굴리기
            if i == j+k:                            # key값 i 와 주사위 2개의 합계가 같을 때 경우
                values = j, k                         # 주사위 번호를 변수에 저장
                values_list.append(values)           # 주사위번호를 value_list에 추가 
                a[i] = (values_list)                  # key, value를 딕셔너리에 추가
# -------------------------------------------------------------------------------------------

# 문제
-	For문을 이용하여 주사위 2개 굴려서 나올 수 있는 합계를 key로 생성 (range() 사용)
-	합계에 맞춰 나올 수 있는 value값에 list형태로 저장  
-	결과 화면 
'''

# # 1차 시도
# dice1 = [1, 2, 3, 4, 5, 6]
# dice2 = [1, 2, 3, 4, 5, 6]

# key_list = []
# values_list = []
# list = []
# sums_list = []
# for i in dice1:
#     for j in dice2:
#         key = i+j  # 합 계
#         values = i, j  # 경우의 수
#         key_list.append(key)
#         values_list.append(values)


# dicts = {name: value for name, value in zip(key_list, values_list)}
# # for (x,y) in values_list:
# #    if (x+y) = key_list:


# print(dicts) # # {2: (1, 1), 3: (2, 1), 4: (3, 1), 5: (4, 1), 6: (5, 1), 7: (6, 1), 8: (6, 2), 9: (6, 3), 10: (6, 4), 11: (6, 5), 12: (6, 6)}
# print(key_list) # # [2, 3, 4, 5, 6, 7, 3, 4, 5, 6, 7, 8, 4, 5, 6, 7, 8, 9, 5, 6, 7, 8, 9, 10, 6, 7, 8, 9, 10, 11, 7, 8, 9, 10, 11, 12]
# print(values_list)  # [(1, 1), (1, 2), (1, 3), (1, 4), (1, 5), (1, 6), (2, 1), (2, 2), (2, 3), (2, 4), (2, 5), (2, 6), (3, 1), (3, 2), (3, 3), (3, 4), (3, 5), (3, 6), (4, 1), (4, 2), (4, 3), (4, 4), (4, 5), (4, 6), (5, 1), (5, 2), (5, 3), (5, 4), (5, 5), (5, 6), (6, 1), (6, 2), (6, 3), (6, 4), (6, 5), (6, 6)]


# -------------------------------------------------------------------------------------------
#
# # 2차 시도 - 성공

# 딕셔너리 생성
dict = {}

#  key 값 - 주사위 합계 경우의 수 생성
for i in range(2, 13):
    # value값 - key 값이 증가 할 때 마다 key 값에 들어갈 list 생성
    values_list = []
    # 주사위 1번 굴리기
    for j in range(1, 7):
        # 주사위 2번 굴리기
        for k in range(1, 7):
            if i == j+k:                             # key값 i 와 주사위 2개의 합계가 같을 때 경우
                values = j, k                        # 주사위 번호를 변수에 저장
                values_list.append(values)           # 주사위번호를 value_list에 추가 
                dict[i] = (values_list)              # key, value를 딕셔너리에 추가
print(dict)  # {2: [(1, 1)], 3: [(1, 2), (2, 1)], 4: [(1, 3), (2, 2), (3, 1)], 5: [(1, 4), (2, 3), (3, 2), (4, 1)], 6: [(1, 5), (2, 4), (3, 3), (4, 2), (5, 1)], 7: [(1, 6), (2, 5), (3, 4), (4, 3), (5, 2), (6, 1)], 8: [(2, 6), (3, 5), (4, 4), (5, 3), (6, 2)], 9: [(3, 6), (4, 5), (5, 4), (6, 3)], 10: [(4, 6), (5, 5), (6, 4)], 11: [(5, 6), (6, 5)], 12: [(6, 6)]}
